<a href="https://colab.research.google.com/github/subhamghimire/Machine-Learning/blob/master/second_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
import numpy as np

In [4]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [5]:
pd.DataFrame({'0':[0,0],'1':[0,1]}) #and operation

   0  1
0  0  0
1  0  1

In [6]:
pd.Series([1,2,3,4,5],['a','b','c','d','e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
my_data = [1,2,3,4]
arr = np.array(my_data)
labels = ['a','b','c','d']
d = {'a':0,'b':10,'c':100}
arr

array([1, 2, 3, 4])

In [8]:
pd.Series(my_data,labels)

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
pd.Series(d)

a      0
b     10
c    100
dtype: int64

In [10]:
labels

['a', 'b', 'c', 'd']

In [11]:
pd.Series(labels)

0    a
1    b
2    c
3    d
dtype: object

In [0]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [0]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [16]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [0]:
from numpy.random import randn
np.random.seed(101)

In [0]:
np.random.seed(101)

In [0]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df.X

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [22]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [23]:
type(df['X'])

pandas.core.series.Series

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df[['W','Y']] #selecting columns

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [26]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [0]:
df.drop('new',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [30]:
df.shape

(5, 4)

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.loc['A']   #selecting rows

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [33]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [34]:
df.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [35]:
df.loc['A','X']

0.6281327087844596

In [36]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [0]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [40]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [41]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [42]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [43]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [44]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [45]:
df.xs(1,level='Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

In [46]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [0]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [0]:
df = pd.DataFrame(d)

In [54]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [56]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [61]:
df.dropna(thresh=2) #atmost 2 non-Nan should there

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [62]:
df.fillna(value="N/A")

     A    B  C
0    1    5  1
1    2  N/A  2
2  N/A  N/A  3

In [63]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [0]:
#Groupby
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [0]:
df = pd.DataFrame(data)

In [66]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [77]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [0]:
byComp = df.groupby('Company')

In [76]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [80]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [0]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [0]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [83]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [84]:
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [0]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [86]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [87]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [88]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [0]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [90]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [91]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [92]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [93]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [0]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [95]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [96]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [97]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [123]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [124]:
df['col2'].unique()

array([444, 555, 666])

In [125]:
df['col2'].nunique() #length of unique value

3

In [126]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [127]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [0]:
#Applying Functions
def times2(x):
  return x*2

In [129]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [130]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [131]:
df['col1'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [0]:
#Permanently Removing a Column
del df['col1']

In [134]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [135]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [119]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [120]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [0]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [138]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [139]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [140]:
#Data input and output
pwd

'/content'

In [144]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [0]:
df.to_csv('Output',index=False)

In [149]:
pd.read_csv('Output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [152]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [0]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='Newsheet')

In [178]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
df[0]

                             Bank Name  ...       Closing Date
0                 The First State Bank  ...      April 3, 2020
1                   Ericson State Bank  ...  February 14, 2020
2     City National Bank of New Jersey  ...   November 1, 2019
3                        Resolute Bank  ...   October 25, 2019
4                Louisa Community Bank  ...   October 25, 2019
..                                 ...  ...                ...
556                 Superior Bank, FSB  ...      July 27, 2001
557                Malta National Bank  ...        May 3, 2001
558    First Alliance Bank & Trust Co.  ...   February 2, 2001
559  National State Bank of Metropolis  ...  December 14, 2000
560                   Bank of Honolulu  ...   October 13, 2000

[561 rows x 6 columns]

In [0]:
from sqlalchemy import create_engine

In [201]:
engine = create_engine('sqlite:///:memory:', echo=True)
#engine = create_engine('sqlite:///:memory:')
conn = engine.connect()

2020-04-22 12:00:33,614 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2020-04-22 12:00:33,616 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:00:33,618 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2020-04-22 12:00:33,619 INFO sqlalchemy.engine.base.Engine ()

In [207]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [208]:
df.to_sql('my_table',con=engine)

2020-04-22 12:11:23,924 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("my_table")
2020-04-22 12:11:23,925 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:23,927 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("my_table")
2020-04-22 12:11:23,928 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:23,936 INFO sqlalchemy.engine.base.Engine
CREATE TABLE my_table (
	"index" BIGINT,
	a BIGINT,
	b BIGINT,
	c BIGINT,
	d BIGINT
)


2020-04-22 12:11:23,938 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:23,945 INFO sqlalchemy.engine.base.Engine COMMIT
2020-04-22 12:11:23,946 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_my_table_index ON my_table ("index")
2020-04-22 12:11:23,948 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:23,950 INFO sqlalchemy.engine.base.Engine COMMIT
2020-04-22 12:11:23,956 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-04-22 12:11:23,958 INFO sqlalchemy.engine.base.Engine INSERT INTO my_table ("index", a, b, c, d) VALUES (?, ?, ?, ?, ?)
2020-04-22 12:11:23,959 INFO sqlalchemy.engine.base.Engine ((0, 0, 1, 2, 3), (1, 4, 5, 6, 7), (2, 8, 9, 10, 11), (3, 12, 13, 14, 15))
2020-04-22 12:11:23,961 INFO sqlalchemy.engine.base.Engine COMMIT

In [209]:
sql_df = pd.read_sql('my_table',conn)

2020-04-22 12:11:51,948 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("my_table")
2020-04-22 12:11:51,949 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,951 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-04-22 12:11:51,951 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,953 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("my_table")
2020-04-22 12:11:51,954 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,956 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'my_table' AND type = 'table'
2020-04-22 12:11:51,959 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,961 INFO sqlalchemy.engine.base.Engine PRAGMA main.foreign_key_list("my_table")
2020-04-22 12:11:51,963 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,964 INFO sqlalchemy.engine.base.Engine PRAGMA temp.foreign_key_list("my_table")
2020-04-22 12:11:51,967 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,968 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'my_table' AND type = 'table'
2020-04-22 12:11:51,969 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,974 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("my_table")
2020-04-22 12:11:51,975 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,975 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_info("ix_my_table_index")
2020-04-22 12:11:51,977 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,978 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("my_table")
2020-04-22 12:11:51,981 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,983 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_info("ix_my_table_index")
2020-04-22 12:11:51,986 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,987 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'my_table' AND type = 'table'
2020-04-22 12:11:51,990 INFO sqlalchemy.engine.base.Engine ()
2020-04-22 12:11:51,995 INFO sqlalchemy.engine.base.Engine SELECT my_table."index", my_table.a, my_table.b, my_table.c, my_table.d
FROM my_table
2020-04-22 12:11:51,997 INFO sqlalchemy.engine.base.Engine ()

In [210]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15